# CannottFindCorrectTreeNode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemNavigatorFailures..::..CannottFindCorrectTreeNode Property
BuiltInFailures..::..SystemNavigatorFailures Class See Also
---
Can't find the correct tree node in system browser according to the node index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannottFindCorrectTreeNode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannottFindCorrectTreeNode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannottFindCorrectTreeNode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemNavigatorFailures Class
Autodesk.Revit.DB Namespace